<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('pages')->insert([
            'slug' => "مقدمة",
            'title' => "مقدمة تعريفية للجمعية",
            'content' => "<h4>مقدمة:</h4><p>يحيط بشبام التاريخية اراضي زراعية )جروب( تقدر مساحتها 160 فدان من الجهات الشرقية والشمالية والغربية تروى بمياه الفيضانات وقد نشأ االجداد نظام بديع للري يمتد من سد الموزع )5كم( غربي المدينة ويمر بالساقية الرئيسية )ساقية البالد( ثم سواقي فرعية تتفرع الى سواقي )قنوات( فرعية صغيرة لينساب الماء الى الجروب المحاذية للمدينة مزروعة بأشجار النخيل والتي كانت تمد السكان بالتمور.</p><p><strong>مجال العمل الرئيسي:</strong></p><ol><li>المحافظة واإلدارة واالشراف الكامل على الموروث الزراعي المتمثل في شبكة الري السيلي التقليدية والمشتملة على سد الموزع التحويلي والسواقي الرئيسية والفرعية.&nbsp;</li><li>تحسين و تطوير نظام الري المزدوج لزراعة مساحات من أراضي الربة بطريقة مجدية اقتصاديا.&nbsp;</li><li>تنظيم اخذ الطين من الواحات (الجروب) وذلك للحفاظ على المنسوب المطلوب لجريان السيول.&nbsp;</li><li>السعي الستثمار مساهمات االعضاء بما يعود بالنفع عليهم وعلى الجمعية.</li></ol><p><strong>دور جمعية الربة في الحفاظ على مدينة شبام التاريخية وموروثها الزراعي:</strong></p><ul><li>اشراف الجمعية بالشراكة مع الهيئة العامة للمحافظة على المدن التاريخية على منطقة الحفاظ (2A) (منطقة الفيضانات/الواحات), وايضا منطقة الحمى(6B) قاع الوادي الرئيسي (منطقة الفيضانات) شرق وغرب المدينة والتي تمت بواسطة قرارات مجلس الوزراء الخاصة بحمايتها. ولدى جمعية الربة الصالحية المطلقة إليقاف اي اعمال مستحدثة في مناطق الفيضانات وذلك حسب االعراف والقوانين المتعامل بها والتي قد تؤثر سلبا على مدينة شبام التاريخية.</li><li>تحويل مياه السيول عبر سد الموزع (السد التحويلي) الى االراضي الزراعية الواقعة حول المدينة مما يبعد خطر الفيضانات عن المدينة التاريخية مثل ما حصل في كارثة فيضانات 2008 في حضرموت.</li><li>تخفيف ضغط الفيضانات وذلك عبر تصريف كميات من المياه الزائدة عبر مخارج الجروب.</li><li>الحفاظ على الموروث الزراعي في نظام الري التقليدي وصيانته.</li><li>الحفاظ على الفذ (سجل يحوي اسماء الجروب ومساحتها وحدودها) ومعالم االراضي الزراعية وحدودها.</li><li>السعي للمحافظة على االعراف السائدة التي تنظم عالقات المنتفعين بالمالك وكذا فض النزاعات التي قد تنشأ بينهم اوبين المنتفعين انفسهم.</li></ul>",
            'created_at' => '2024-06-27 05:08:00',
        ]);
    }
}
