<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class PostSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('posts')->insert([
            'title' => "إصلاح مكسر في الساقية الرئيسية –جهة المدينة من الغرب",
            'slug' => "إصلاح-مكسر في-الساقية-الرئيسية–جهة-المدينة-من-الغرب",
            'body' => "<p>تم اصالح مكسر جراء سيل في 2004/04/13 بطول 150 متر بكلفة (1104550) لاير ,تمويل %50 من المؤسسة 
            المحلية للمياه و %50 من السلطة المحلية .</p>",
            'type' => 2,
            'user_id' => 3,
            'approved' => true,
            'category_id' => 1,
            'created_at' => '2024-06-27 05:08:00',
            'image_path' => 'example.png'
        ]);

        DB::table('posts')->insert([
            'title' => "مشروع اعادة تأهيل بعض منشآت الري السيلي التقليدي (بدود ومداخل الجروب)",
            'slug' => "مشروع-اعادة-تأهيل-بعض-منشآت-الري-السيلي-التقليدي-(بدود-ومداخل-الجروب)",
            'body' => "<p>التمويل: المشروع اليمني األلماني لتنمية المدن الحضرية بشبام بنسبة %65 ومساهمة الجمعية %35
            تنفيذ: جمعية الربّة التعاونية الزراعية
            تم تنفيذ المشروع في ديسمبر 2006 –يناير 2007(
            ويتلخص المشروع في االتي:
             اعمال اصالح الساقية الرئيسية
            - ازالة اشجار السيسبان.
             اعمال انشاء و ترميم البدود والحواسات</p>",
            'type' => 2,
            'user_id' => 1,
            'approved' => true,
            'category_id' => 3,
            'created_at' => '2024-06-27 05:08:00',
            'image_path' => 'example.png',
        ]);

        DB::table('posts')->insert([
            'title' => "صيانة سد الموزع التحويلي",
            'slug' => "صيانة-سد-الموزع-التحويلي",
            'body' => "<p>التقاء خطر السيول الجارفة ولالستفادة من مياه السيول فكر االجداد في بناء سد واختاروا لذلك موقع بالقرب من قرية 
            العقاد عند ملتقى مياه السيول التي تأتي من الوديان الشمالية والغربية, فهو من ناحية يحمي مدينة شبام التاريخية من خطر 
            السيول الجارفة وينظم االستفادة منها لري األراضي الزراعية المحيطة بالمدينة من ناحية أخرى. يقع على عاتق جمعية 
            الربّة مسؤولية صيانة سد الموزع واخذ الطين المترسب الزائد ومن هذا المنطلق تقوم الجمعية وعبر المهندسين المختصين 
            بتفقد السد بعد موسم السيول إلصالح أي ضرار تظهر قبل ان تستفحل. بسبب سيول 2008 نفذت الجمعية وبعد التشاور 
            مع المهندسين المختصين وبتمويل ذاتي يهدف الى استيعاب كمية أكبر من مياه السيول بالقناة الرئيسية )ساقية البالد( لري 
            االراضي الزراعية )الجروب( ويتلخص المشروع في رفع مستوى البناء الحجري بمقدار 21 سم يمتد بطول 501 متر 
            ويتم التطيين بوضع كميات من االتربة فوق البناء الحجري يتم ازاحته في حالة قدوم سيول كبيرة تهدد منطقة العقاد.
            </p>",
            'type' => 2,
            'user_id' => 1,
            'approved' => true,
            'category_id' => 2,
            'created_at' => '2024-06-27 05:08:00',
            'image_path' => 'example.png',
        ]);

        DB::table('posts')->insert([
            'title' => "المشروع الطارئ لمعالجة اضرار السيول بمنشآت الربّة الناتج عن سيول اكتوبر 2008 عام 200",
            'slug' => "المشروع-الطارئ-لمعالجة-اضرار-السيول-بمنشآت-الربّة-الناتج-عن-سيول-اكتوبر-2008-عام-200",
            'body' => "<p>الجهة الممولة: مشروع تنمية المدن التاريخية باليمن
            الجهة المنفذة: جمعية الربّة التعاونية الزراعية
            ويتضمن المشروع في اآلتي:
             اعادة مكسر الساقية الرئيسية في منطقة العقاد
             تعزيز سوم الساقية الرئيسية جهة الوادي والممتد من الموزع حتى بئر السعدي في منطقة عبوده
             رفع مستوى البناء الحجري بالموزع )الفيوز( 0.70 متر الى 1 متر</p>",
            'type' => 2,
            'user_id' => 2,
            'approved' => true,
            'category_id' => 2,
            'created_at' => '2024-06-27 05:08:00',
            'image_path' => 'example.png',
        ]);

        DB::table('posts')->insert([
            'title' => "مكسر في الساقية الرئيسية –جهة المدينة من الغرب",
            'slug' => "مكسر في-الساقية-الرئيسية–جهة-المدينة-من-الغرب",
            'body' => "<p>تم اصالح مكسر جراء سيل في 2004/04/13 بطول 150 متر بكلفة (1104550) لاير ,تمويل %50 من المؤسسة 
            المحلية للمياه و %50 من السلطة المحلية .</p>",
            'type' => 2,
            'user_id' => 3,
            'approved' => true,
            'category_id' => 1,
            'created_at' => '2024-06-27 05:08:00',
            'image_path' => 'example.png'
        ]);

        DB::table('posts')->insert([
            'title' => "اعادة تأهيل بعض منشآت الري السيلي التقليدي (بدود ومداخل الجروب)",
            'slug' => "اعادة-تأهيل-بعض-منشآت-الري-السيلي-التقليدي-(بدود-ومداخل-الجروب)",
            'body' => "<p>التمويل: المشروع اليمني األلماني لتنمية المدن الحضرية بشبام بنسبة %65 ومساهمة الجمعية %35
            تنفيذ: جمعية الربّة التعاونية الزراعية
            تم تنفيذ المشروع في ديسمبر 2006 –يناير 2007(
            ويتلخص المشروع في االتي:
             اعمال اصالح الساقية الرئيسية
            - ازالة اشجار السيسبان.
             اعمال انشاء و ترميم البدود والحواسات</p>",
            'type' => 2,
            'user_id' => 1,
            'approved' => true,
            'category_id' => 3,
            'created_at' => '2024-06-27 05:08:00',
            'image_path' => 'example.png',
        ]);

        DB::table('posts')->insert([
            'title' => "صيانة سد الموزع التحويلي كامل",
            'slug' => "صيانة-سد-الموزع-التحويلي كامل",
            'body' => "<p>التقاء خطر السيول الجارفة ولالستفادة من مياه السيول فكر االجداد في بناء سد واختاروا لذلك موقع بالقرب من قرية 
            العقاد عند ملتقى مياه السيول التي تأتي من الوديان الشمالية والغربية, فهو من ناحية يحمي مدينة شبام التاريخية من خطر 
            السيول الجارفة وينظم االستفادة منها لري األراضي الزراعية المحيطة بالمدينة من ناحية أخرى. يقع على عاتق جمعية 
            الربّة مسؤولية صيانة سد الموزع واخذ الطين المترسب الزائد ومن هذا المنطلق تقوم الجمعية وعبر المهندسين المختصين 
            بتفقد السد بعد موسم السيول إلصالح أي ضرار تظهر قبل ان تستفحل. بسبب سيول 2008 نفذت الجمعية وبعد التشاور 
            مع المهندسين المختصين وبتمويل ذاتي يهدف الى استيعاب كمية أكبر من مياه السيول بالقناة الرئيسية )ساقية البالد( لري 
            االراضي الزراعية )الجروب( ويتلخص المشروع في رفع مستوى البناء الحجري بمقدار 21 سم يمتد بطول 501 متر 
            ويتم التطيين بوضع كميات من االتربة فوق البناء الحجري يتم ازاحته في حالة قدوم سيول كبيرة تهدد منطقة العقاد.
            </p>",
            'type' => 2,
            'user_id' => 1,
            'approved' => true,
            'category_id' => 2,
            'created_at' => '2024-06-27 05:08:00',
            'image_path' => 'example.png',
        ]);

        DB::table('posts')->insert([
            'title' => "المشروع الطارئ لمعالجة اضرار السيول بمنشآت الربّة الناتج عن سيول اكتوبر",
            'slug' => "المشروع-الطارئ-لمعالجة-اضرار-السيول-بمنشآت-الربّة-الناتج-عن-سيول-اكتوبر",
            'body' => "<p>الجهة الممولة: مشروع تنمية المدن التاريخية باليمن
            الجهة المنفذة: جمعية الربّة التعاونية الزراعية
            ويتضمن المشروع في اآلتي:
             اعادة مكسر الساقية الرئيسية في منطقة العقاد
             تعزيز سوم الساقية الرئيسية جهة الوادي والممتد من الموزع حتى بئر السعدي في منطقة عبوده
             رفع مستوى البناء الحجري بالموزع )الفيوز( 0.70 متر الى 1 متر</p>",
            'type' => 2,
            'user_id' => 2,
            'approved' => true,
            'category_id' => 2,
            'created_at' => '2024-06-27 05:08:00',
            'image_path' => 'example.png',
        ]);

        DB::table('posts')->insert([
            'title' => "إصلاح مكسر في الساقية –جهة المدينة من الغرب",
            'slug' => "إصلاح-مكسر في-الساقية–جهة-المدينة-من-الغرب",
            'body' => "<p>تم اصالح مكسر جراء سيل في 2004/04/13 بطول 150 متر بكلفة (1104550) لاير ,تمويل %50 من المؤسسة 
            المحلية للمياه و %50 من السلطة المحلية .</p>",
            'type' => 2,
            'user_id' => 3,
            'approved' => true,
            'category_id' => 1,
            'created_at' => '2024-06-27 05:08:00',
            'image_path' => 'example.png'
        ]);

        DB::table('posts')->insert([
            'title' => "مشروع اعادة تأهيل بعض منشآت الري السيلي (بدود ومداخل الجروب)",
            'slug' => "مشروع-اعادة-تأهيل-بعض-منشآت-الري-السيلي-(بدود-ومداخل-الجروب)",
            'body' => "<p>التمويل: المشروع اليمني األلماني لتنمية المدن الحضرية بشبام بنسبة %65 ومساهمة الجمعية %35
            تنفيذ: جمعية الربّة التعاونية الزراعية
            تم تنفيذ المشروع في ديسمبر 2006 –يناير 2007(
            ويتلخص المشروع في االتي:
             اعمال اصالح الساقية الرئيسية
            - ازالة اشجار السيسبان.
             اعمال انشاء و ترميم البدود والحواسات</p>",
            'type' => 3,
            'user_id' => 1,
            'approved' => true,
            'category_id' => 3,
            'created_at' => '2024-06-27 05:08:00',
            'image_path' => 'example.png',
        ]);

        DB::table('posts')->insert([
            'title' => "صيانة سد الموزع التحويلي كاملا",
            'slug' => "صيانة-سد-الموزع-التحويلي كاملا",
            'body' => "<p>التقاء خطر السيول الجارفة ولالستفادة من مياه السيول فكر االجداد في بناء سد واختاروا لذلك موقع بالقرب من قرية 
            العقاد عند ملتقى مياه السيول التي تأتي من الوديان الشمالية والغربية, فهو من ناحية يحمي مدينة شبام التاريخية من خطر 
            السيول الجارفة وينظم االستفادة منها لري األراضي الزراعية المحيطة بالمدينة من ناحية أخرى. يقع على عاتق جمعية 
            الربّة مسؤولية صيانة سد الموزع واخذ الطين المترسب الزائد ومن هذا المنطلق تقوم الجمعية وعبر المهندسين المختصين 
            بتفقد السد بعد موسم السيول إلصالح أي ضرار تظهر قبل ان تستفحل. بسبب سيول 2008 نفذت الجمعية وبعد التشاور 
            مع المهندسين المختصين وبتمويل ذاتي يهدف الى استيعاب كمية أكبر من مياه السيول بالقناة الرئيسية )ساقية البالد( لري 
            االراضي الزراعية )الجروب( ويتلخص المشروع في رفع مستوى البناء الحجري بمقدار 21 سم يمتد بطول 501 متر 
            ويتم التطيين بوضع كميات من االتربة فوق البناء الحجري يتم ازاحته في حالة قدوم سيول كبيرة تهدد منطقة العقاد.
            </p>",
            'type' => 1,
            'user_id' => 1,
            'approved' => true,
            'category_id' => 2,
            'created_at' => '2024-06-27 05:08:00',
            'image_path' => 'example.png',
        ]);

        DB::table('posts')->insert([
            'title' => "المشروع الطارئ لمعالجة اضرار السيول بمنشآت الربّة الناتج عن سيول اكتوبر2008 عام",
            'slug' => "المشروع-الطارئ-لمعالجة-اضرار-السيول-بمنشآت-الربّة-الناتج-عن-سيول-اكتوبر2008-عام",
            'body' => "<p>الجهة الممولة: مشروع تنمية المدن التاريخية باليمن
            الجهة المنفذة: جمعية الربّة التعاونية الزراعية
            ويتضمن المشروع في اآلتي:
             اعادة مكسر الساقية الرئيسية في منطقة العقاد
             تعزيز سوم الساقية الرئيسية جهة الوادي والممتد من الموزع حتى بئر السعدي في منطقة عبوده
             رفع مستوى البناء الحجري بالموزع )الفيوز( 0.70 متر الى 1 متر</p>",
            'type' => 1,
            'user_id' => 2,
            'approved' => true,
            'category_id' => 2,
            'created_at' => '2024-06-27 05:08:00',
            'image_path' => 'example.png',
        ]);
        // DB::table('posts')->insert([
        //     'title' => "",
        //     'slug' => "",
        //     'body' => "<p></p>",
        //     'type' => 2,
        //     'user_id' => 2,
        //     'approved' => true,
        //     'category_id' => 2,
        //     'created_at' => '2024-06-27 05:08:00',
        //     'image_path' => 'example.png',
        // ]);
    }
}
