<section class="most-read">
    <div class="container">
        <h2 class="section-title">
            الأكثر قراءة
        </h2>
        <div class="card-news">
            <a href="./article.html">
                <div class="row">
                    <div class="col-md-5">
                        <img src="./images/picture-12.jpg" alt="...">
                    </div>
                    <div class="col-md-7">
                        <div class="card-text">
                            <h4>لوريم ايبسوم دولار سيت أميت كونسيكتيتور أدايبا يسكينج أليايتسيت</h4>
                            <p>
                                لوريم ايبسوم دولار سيت أميت كونسيكتيتور أدايبا يسكينج أليايتسيت دو أيوسمود
                                تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا
                                . يوت انيم أد مينيم فينايمكيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت
                                أليكيوب أكس أيا كوممودو كونسيكيوات
                                . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت
                                أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور
                                . أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت سيونت ان كيولبا كيو
                                أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم
                            </p>
                            <time datetime="18-12-2022">
                                الأحد، 18-12-2022
                            </time>
                        </div>
                    </div>
                </div>
            </a>
        </div>
        <div class="card-news">
            <a href="./article.html">
                <div class="card-img">
                    <img src="./images/picture-15.jpg" alt="...">
                </div>
                <div class="card-text">
                    <h4>لوريم ايبسوم دولار سيت أميت كونسيكتيتور أدايبا يسكينج أليايتسيت</h4>
                    <time datetime="18-12-2022">
                        الأحد، 18-12-2022
                    </time>
                </div>
            </a>
        </div>
        <div class="card-news">
            <a href="./article.html">
                <div class="row">
                    <div class="col-md-5">
                        <img src="./images/picture-12.jpg" alt="...">
                    </div>
                    <div class="col-md-7">
                        <div class="card-text">
                            <h4>لوريم ايبسوم دولار سيت أميت كونسيكتيتور أدايبا يسكينج أليايتسيت</h4>
                            <p>
                                لوريم ايبسوم دولار سيت أميت كونسيكتيتور أدايبا يسكينج أليايتسيت دو أيوسمود
                                تيمبور أنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا
                                . يوت انيم أد مينيم فينايمكيواس نوستريد أكسير سيتاشن يللأمكو لابورأس نيسي يت
                                أليكيوب أكس أيا كوممودو كونسيكيوات
                                . ديواس أيوتي أريري دولار إن ريبريهينديرأيت فوليوبتاتي فيلايت
                                أيسسي كايلليوم دولار أيو فيجايت نيولا باراياتيور
                                . أيكسسيبتيور ساينت أوككايكات كيوبايداتات نون بروايدينت سيونت ان كيولبا كيو
                                أوفيسيا ديسيريونتموليت انيم أيدي ايست لابوريوم
                            </p>
                            <time datetime="18-12-2022">
                                الأحد، 18-12-2022
                            </time>
                        </div>
                    </div>
                </div>
            </a>
        </div>
    </div>
</section>